In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
df = pd.read_csv("C:/Users/ashok/Downloads/df_anscombe.csv")
df.head()

      x     y  group
0  10.0  8.04      1
1   8.0  6.95      1
2  13.0  7.58      1
3   9.0  8.81      1
4  11.0  8.33      1

In [3]:
df.group.nunique()  #counting the number of unique groups

4

In [10]:
df.groupby('group').describe()

          x                                               y            \
      count mean       std  min  25%  50%   75%   max count      mean
group
1      11.0  9.0  3.316625  4.0  6.5  9.0  11.5  14.0  11.0  7.500909
2      11.0  9.0  3.316625  4.0  6.5  9.0  11.5  14.0  11.0  7.500909
3      11.0  9.0  3.316625  4.0  6.5  9.0  11.5  14.0  11.0  7.500000
4      11.0  9.0  3.316625  8.0  8.0  8.0   8.0  19.0  11.0  7.500909


            std   min    25%   50%   75%    max
group
1      2.031568  4.26  6.315  7.58  8.57  10.84
2      2.031657  3.10  6.695  8.14  8.95   9.26
3      2.030424  5.39  6.250  7.11  7.98  12.74
4      2.030579  5.25  6.170  7.04  8.19  12.50

In [11]:
df.groupby('group').corr()

                x         y
group
1     x  1.000000  0.816421
      y  0.816421  1.000000
2     x  1.000000  0.816237
      y  0.816237  1.000000
3     x  1.000000  0.816287
      y  0.816287  1.000000
4     x  1.000000  0.816521
      y  0.816521  1.000000

In [13]:
#second dataset
df_2 = pd.read_csv("C:/Users/ashok/Downloads/datasaurus.csv")
df_2.head()

  group        x        y
0  dino  55.3846  97.1795
1  dino  51.5385  96.0256
2  dino  46.1538  94.4872
3  dino  42.8205  91.4103
4  dino  40.7692  88.3333

In [16]:
df_2.group.nunique()  #total number of unique groups

13